{
  "backend/main.mo": "Motoko backend handling contact form submissions, password- and role-protected admin queries, and simple user profile storage with access control.",
  "feature_evidence.json": "Feature evidence report listing implemented admin password login, dashboard updates, and session persistence with referenced files and components.",
  "frontend-file-summaries.txt": "Text mapping frontend file paths to short descriptions of their purpose within the site and admin panel.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables, light/dark themes, and global background/foreground styling.",
  "frontend/index.html": "HTML entry point defining metadata, title, and root element for the React app.",
  "frontend/src/App.tsx": "Main React app with QueryClientProvider and hash-based routing between the marketing site and password-protected admin page.",
  "frontend/src/components/admin/AdminPage.tsx": "Password-only admin panel that authenticates with a fixed password and fetches contact submissions for display with logout and error handling.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button component that manages authentication state and clears query cache on logout.",
  "frontend/src/components/sections/AboutSection.tsx": "Marketing About section describing Vinod Electriclas’ background, expertise, and product focus.",
  "frontend/src/components/sections/ContactSection.tsx": "Renders contact info cards and a form using useContactForm, showing success or error alerts based on submission status.",
  "frontend/src/components/sections/HeroSection.tsx": "Displays the homepage hero banner with product tagline, CTA buttons, and a hero image with smooth scrolling handlers.",
  "frontend/src/components/sections/ServicesSection.tsx": "Shows a grid of service cards and a gallery of product images describing panels, meters, and motor-control solutions.",
  "frontend/src/components/sections/WhyChooseUsSection.tsx": "Lists key business advantages in a grid, each with an icon, title, and description.",
  "frontend/src/components/site/Footer.tsx": "Provides footer branding, contact details, external links, and an admin link.",
  "frontend/src/components/site/Header.tsx": "Implements a sticky header with logo, nav links, smooth scrolling, and a mobile menu via a sheet.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, handling authentication, access control initialization, and query invalidation.",
  "frontend/src/hooks/useAdminPasswordSession.ts": "Manages admin session state in sessionStorage with login and logout helpers.",
  "frontend/src/hooks/useContactForm.ts": "Custom hook managing contact form state, validation, and submission via a mutation, with auto-reset and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, status tracking, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for admin checks, fetching submissions, submitting contact forms, and managing user profiles via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS base setup defining theme variables, light/dark palettes, global styles, and utility layers.",
  "frontend/src/main.tsx": "App bootstrap that mounts React, providing QueryClient and InternetIdentity context providers.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, fonts, components, animations, and plugins.",
  "project_state.json": "Describes project requirements, admin password flow, existing issues, and pending feature requests."
}