{
  "backend/main.mo": "Motoko canister with access control, contact form submission storage, and user profile management.",
  "feature_evidence.json": "Feature evidence report describing a footer website-link requirement and associated files/components.",
  "frontend-file-summaries.txt": "List of autogenerated summaries for all frontend files used in the project.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens, dark mode variables, and global styling.",
  "frontend/index.html": "HTML entry point setting page metadata and loading the React application.",
  "frontend/src/App.tsx": "Root React component handling hash-based routing between the home site and admin panel.",
  "frontend/src/components/admin/AdminPage.tsx": "Admin panel with Internet Identity login, profile setup, admin check, and submissions table.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button that manages authentication state and clears query cache.",
  "frontend/src/components/sections/AboutSection.tsx": "Marketing about section describing company experience and offerings.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact section with business info cards and a validated form submitted through a custom hook.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with headline, description, call-to-action buttons, and a hero image with scroll-to-section logic.",
  "frontend/src/components/sections/ServicesSection.tsx": "Displays product/service cards and a gallery of installation images using predefined service data.",
  "frontend/src/components/sections/WhyChooseUsSection.tsx": "Shows a grid of reasons highlighting company strengths, each with an icon, title, and description.",
  "frontend/src/components/site/Footer.tsx": "Footer with brand info, contact details, copyright text, and external/admin links.",
  "frontend/src/components/site/Header.tsx": "Sticky header with logo, navigation buttons, smooth scrolling, and a mobile menu via a sheet component.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useContactForm.ts": "Manages contact form state, validation, submission via mutation, and provides status and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for admin checks, fetching submissions, submitting forms, and getting/saving the caller's user profile via the backend actor.",
  "frontend/src/index.css": "Tailwind base/styles with custom OKLCH theme variables, light/dark palettes, globals, and utility components.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, radii, animations, and enabling plugins.",
  "project_state.json": "Project metadata describing site purpose, requirements, known issues, and existing implemented features."
}